function generate() {
  let quotes = {
    ' שחר כהן  ': '" מי שמפחד להסתכן, מסתכן בחיים של בינוניות " ',
    ' מאיה אנגלו  ':
      '" אם תמיד תנסו להיות נורמלים, לעולם לא תדעו כמה מדהימים אתם יכולים להיות " ',
    ' תומס אלווס אדיסון ':
      '" החולשה הגדולה ביותר שלנו היא הותרנות, הדרך הבטוחה ביותר להצליח היא תמיד להמשיך ולנסות פעם אחת נוספת " ',
    ' ווינסטון צרציל  ':
      '" אדם פסימי רואה את הקושי בכל הזדמנות, אדם אופטימי רואה הזדמנות בכל קושי " ',
    ' צרלס סוידול  ':
      '"החיים הם 10 אחוז מה שקורה לך ו90 אחוז איך שאתה מגיב לאירועים " ',
    ' מייקל פלפס  ':
      '" אם אתה רוצה להיות הטוב ביותר, אתה צריך להיות מוכן לעשות דברים שאנשים אחרים לא מוכנים לעשות " ',
    ' אלברט איינשטיין  ':
      '" רק מי שלוקח סיכון והולך רחוק, מגלה עד כמה רחוק הוא יכול להגיע " ',
    ' וינסטון צרציל  ':
      '" הצלחה היא היכולת לעבור מכישלון לכישלון מבלי לאבד את ההתלהבות " ',
    ' טוני רובינס  ':
      '" הצבת מטרות זה החלק הראשון בלהפוך את הבלתי נראה לנראה " ',
    ' נפוליאון היל  ':
      '" אם אתה לא יכול לעשות דברים גדולים, תעשה דברים קטנים בדרך גדולה " ',
    ' שחר כהן  ': '" מי שמפחד להסתכן, מסתכן בחיים של בינוניות " ',
  }
  let authors = Object.keys(quotes)

  console.log(authors)

  let author = authors[Math.floor(Math.random() * authors.length)]

  let quote = quotes[author]

  document.getElementById('quote').innerHTML = quote

  document.getElementById('author').innerHTML = author
}

// ' < מחבר  > ' : '  <  ציטוט  >  '
